# Database 2

In [5]:
import sqlite3
import pandas as pd

In [6]:
# ignore this cell (it's just to make certain text red later, but you don't need to understand it).
from IPython.core.display import HTML
HTML('<style>em { color: red; }</style> <style>.container {width:100% !important; }</style>')

In [7]:
c = sqlite3.connect("movies.db")
c

In [8]:
pd.read_sql("select * from sqlite_master", c)

,type,name,tbl_name,rootpage,sql
0,table,movies,movies,2,"CREATE TABLE ""movies"" (\n""Title"" TEXT,\n ""Dir..."

In [9]:
pd.read_sql("select * from movies", c).head(15)

,Title,Director,Year,Runtime,Rating,Revenue
0,Guardians of the Galaxy,James Gunn,2014,121,8.1,333.13
1,Prometheus,Ridley Scott,2012,124,7.0,126.46
2,Split,M. Night Shyamalan,2016,117,7.3,138.12
3,Sing,Christophe Lourdelet,2016,108,7.2,270.32
4,Suicide Squad,David Ayer,2016,123,6.2,325.02
5,The Great Wall,Yimou Zhang,2016,103,6.1,45.13
6,La La Land,Damien Chazelle,2016,128,8.3,151.06
7,Mindhorn,Sean Foley,2016,89,6.4,0.00
8,The Lost City of Z,James Gray,2016,141,7.1,8.01
9,Passengers,Morten Tyldum,2016,116,7.0,100.01
10,Fantastic Beasts and Where to Find Them,David Yates,2016,133,7.5,234.02
11,Hidden Figures,Theodore Melfi,2016,127,7.8,169.27
12,Rogue One,Gareth Edwards,2016,133,7.9,532.17
13,Moana,Ron Clements,2016,107,7.7,248.75
14,Colossal,Nacho Vigalondo,2016,109,6.4,2.87

In [11]:
def qry(sql, cap=10):
    return pd.read_sql(sql, c).head(cap)

In [12]:
qry("""
SELECT *
FROM movies
""")

,Title,Director,Year,Runtime,Rating,Revenue
0,Guardians of the Galaxy,James Gunn,2014,121,8.1,333.13
1,Prometheus,Ridley Scott,2012,124,7.0,126.46
2,Split,M. Night Shyamalan,2016,117,7.3,138.12
3,Sing,Christophe Lourdelet,2016,108,7.2,270.32
4,Suicide Squad,David Ayer,2016,123,6.2,325.02
5,The Great Wall,Yimou Zhang,2016,103,6.1,45.13
6,La La Land,Damien Chazelle,2016,128,8.3,151.06
7,Mindhorn,Sean Foley,2016,89,6.4,0.00
8,The Lost City of Z,James Gray,2016,141,7.1,8.01
9,Passengers,Morten Tyldum,2016,116,7.0,100.01

# Review: Simple Selections

### Which *movie* has the *highest rating*?

In [21]:
qry("""
SELECT Title, rating
FROM movies
ORDER BY Rating DESC
LIMIT 1
""")

             Title  Rating
0  The Dark Knight     9.0

### Which *director* made the *shortest movie*?

In [20]:
qry("""
SELECT director, runtime
FROM movies
ORDER BY runtime
LIMIT 1
""")

        Director  Runtime
0  Claude Barras       66

### Which *director* made the *highest-revenue movie*?

In [26]:
qry("""
SELECT director, revenue, title
FROM movies
ORDER BY revenue DESC
LIMIT 1
""")

      Director  Revenue                                       Title
0  J.J. Abrams   936.63  Star Wars: Episode VII - The Force Awakens

### Which *movie* had the *highest revenues* in *2016*?

In [29]:
qry("""
SELECT title, revenue, year
FROM movies
WHERE year = 2016
ORDER BY revenue DESC
LIMIT 1
""")

       Title  Revenue  Year
0  Rogue One   532.17  2016

### Which *3 movies* had the *highest revenues* in *2016*?

In [30]:
qry("""
SELECT title, revenue, year
FROM movies
WHERE year = 2016
ORDER BY revenue DESC
LIMIT 3
""")

                        Title  Revenue  Year
0                   Rogue One   532.17  2016
1                Finding Dory   486.29  2016
2  Captain America: Civil War   408.08  2016

### Which *3 movies* have the *highest rating-to-revenue ratios*?

Introduce `AS`

In [34]:
qry("""
SELECT title, rating / revenue AS ratio
FROM movies
ORDER BY ratio DESC
LIMIT 3
""")

         Title  ratio
0    Wakefield  750.0
1  Love, Rosie  720.0
2     Lovesong  640.0

# Aggregate Queries

```
SUM, AVG, COUNT, MIN, MAX
```

### How many *movies* are there?

In [37]:
qry("""
SELECT COUNT(*)
FROM movies
""")

   COUNT(*)
0       998

### How many *directors* are there?

In [41]:
qry("""
SELECT COUNT(DISTINCT director)
FROM movies
""")

   COUNT(DISTINCT director)
0                       643

### What is the *total revenue* of *all the movies*?

In [44]:
qry("""
SELECT SUM(revenue)
FROM movies
""")

   SUM(revenue)
0      72215.45

### What is the *average rating* across *all movies*?

* v1: with `SUM` and `COUNT`
* v2: with `AVG`

In [47]:
qry("""
SELECT SUM(rating) / COUNT(*)
FROM movies
""")

   SUM(rating) / COUNT(*)
0                6.723447

In [48]:
qry("""
SELECT AVG(rating)
FROM movies
""")

   AVG(rating)
0     6.723447

### What is the *average revenue* and *average runtime* of *all the movies*?

In [50]:
qry("""
SELECT AVG(revenue), AVG(runtime)
FROM movies
""")

   AVG(revenue)  AVG(runtime)
0      72.36017    113.170341

### What is the *average runtime* for a *James Gunn* movie?

In [52]:
qry("""
SELECT AVG(runtime)
FROM movies
WHERE director = "James Gunn"
""")

   AVG(runtime)
0         104.0

### What is the *average revenue* for a *Ridley Scott* movie?

In [54]:
qry("""
SELECT AVG(revenue)
FROM movies
WHERE director = "Ridley Scott"
""")

   AVG(revenue)
0       89.8825

### *How many movies* were there in *2016*?

In [59]:
qry("""
SELECT COUNT(*)
FROM movies
WHERE year = 2016
""", 1000)

   COUNT(*)
0       296

### What *percentage* of the *total revenue* came from the *highest-revenue movie*?

In [64]:
qry("""
SELECT MAX(revenue) / SUM(revenue) * 100
FROM movies
""")

   MAX(revenue) / SUM(revenue) * 100
0                           1.296994

### What *percentage* of the *total revenue* came from the *highest-revenue movie* in *2016*?

In [65]:
qry("""
SELECT MAX(revenue) / SUM(revenue) * 100
FROM movies
WHERE year = 2016
""")

   MAX(revenue) / SUM(revenue) * 100
0                           4.746581

In [66]:
qry("""
SELECT MAX(revenue), title
FROM movies
WHERE year = 2016
""")

   MAX(revenue)      Title
0        532.17  Rogue One

# GROUP BY Queries

```sql
SELECT ???, ??? FROM Movies
GROUP BY ???
```

### What is the *total revenue* per each *year*?

* v1: the amounts
* v2: the amounts, as labeled by year

In [70]:
qry("""
SELECT year, SUM(revenue)
FROM movies
GROUP BY year
""", 30)

    Year  SUM(revenue)
0   2006       3624.46
1   2007       4306.23
2   2008       5053.22
3   2009       5292.26
4   2010       5989.65
5   2011       5431.96
6   2012       6910.29
7   2013       7544.21
8   2014       7997.40
9   2015       8854.12
10  2016      11211.65

### *How many movies* were by each *director*?

In [74]:
qry("""
SELECT director, COUNT(*) AS mov_count
FROM movies
GROUP BY director
ORDER BY mov_count DESC
""")

             Director  mov_count
0        Ridley Scott          8
1  Paul W.S. Anderson          6
2         Michael Bay          6
3  M. Night Shyamalan          6
4         David Yates          6
5         Zack Snyder          5
6         Woody Allen          5
7          Peter Berg          5
8     Martin Scorsese          5
9          Justin Lin          5

### What is the *average rating* for each *director*?

In [76]:
qry("""
SELECT director, AVG(rating), AVG(runtime)
FROM movies
GROUP BY director
""")

              Director  AVG(rating)  AVG(runtime)
0           Aamir Khan          8.5        165.00
1  Abdellatif Kechiche          7.8        180.00
2            Adam Leon          6.5         82.00
3           Adam McKay          7.0        110.75
4        Adam Shankman          6.3        120.00
5         Adam Wingard          5.9         94.50
6        Afonso Poyart          6.4        101.00
7        Aisling Walsh          7.8        115.00
8         Akan Satayev          6.3         95.00
9       Akiva Schaffer          6.7         87.00

### What is the *average runtime* for each *director*?

### How many *unique directors* created a movie in each *year*

In [85]:
qry("""
SELECT year, COUNT(DISTINCT director) AS director_count
FROM movies
GROUP BY year
""")

   Year  director_count
0  2006              44
1  2007              51
2  2008              51
3  2009              51
4  2010              60
5  2011              63
6  2012              64
7  2013              88
8  2014              97
9  2015             127

# Combining GROUP BY with other CLAUSES

<img src="groupby.png">

### Which *directors* have had the *largest number of movies* earning *over 100M dollars*?

In [91]:
qry("""
SELECT director, COUNT(title) AS count
FROM movies
WHERE revenue > 100
GROUP BY director
ORDER BY count DESC
""")

            Director  count
0        David Yates      6
1        J.J. Abrams      5
2        Zack Snyder      4
3       Ridley Scott      4
4          Paul Feig      4
5        Michael Bay      4
6         Justin Lin      4
7   Francis Lawrence      4
8       Dennis Dugan      4
9  Christopher Nolan      4

### Which *three* of the *directors* have the *greatest average rating*?

In [95]:
qry("""
SELECT director, AVG(rating) AS avg_rating, COUNT(*) as count
FROM movies
GROUP BY director
ORDER BY avg_rating DESC
LIMIT 3
""")

            Director  avg_rating  count
0      Nitesh Tiwari        8.80      1
1  Christopher Nolan        8.68      5
2    Olivier Nakache        8.60      1

Why is the above question maybe not the best to ask?

### Which *three* of the *directors* have the *greatest average rating* over at *least three movies*?

Need filtering BEFORE and AFTER the GROUP operations

<img src="pipeline.png">

# WHERE vs. HAVING

* WHERE: filter rows in original table
* HAVING: filter groups

### Repeat: Which *three* of the *directors* have the *greatest average rating* over at *least three movies*?

<img src="having.png">

### Which *directors* have had *more than 3 movies* that have been *since 2010*?

In [101]:
qry("""
SELECT director, COUNT(title) AS count
FROM movies
WHERE year >= 2010
GROUP BY director
HAVING count > 3
""")

             Director  count
0       Antoine Fuqua      4
1    David O. Russell      4
2         David Yates      4
3    Denis Villeneuve      5
4           James Wan      4
5  M. Night Shyamalan      4
6     Martin Scorsese      4
7         Michael Bay      4
8       Mike Flanagan      4
9           Paul Feig      4

### Which *directors* have had more than *three* movies with runtimes under *100* minutes

In [108]:
qry("""
SELECT director, COUNT(title) AS count
FROM movies
WHERE runtime < 100
GROUP BY director
HAVING count > 3
""")

      Director  count
0  Woody Allen      4

In [8]:
c.close()